
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 114514-student 64-core lab perpetual
Serial number: 9223372036854775807
  Licensed to: LEEKY
               1138

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do ss_spset_syntax_probe.do 

. clear all

. set more off

. version 18

. capture log close _all

. log using "ss_spset_syntax_probe.result.log", text replace
(file
    \\wsl.localhost\Ubuntu\home\leeky\work\SS\.worktrees\issue-353-p4-13-spat
    > ial-output-tn-to\rulebook\tasks\issue-353-p4-13-spatial-output-tn-to\ev
    > idence\ss_spset_syntax_probe.result.log not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\wsl.localhost\Ubuntu\home\leeky\work\SS\.worktrees\issue-353-p4-
> 13-spatial-output-tn-to\rulebook\tasks\issue-353-p4-13-spatial-output-tn-to\e
> vidence\ss_spset_syntax_probe.result.log
  log type:  text
 opened on:  11 Jan 2026, 10:34:12

. import delimited "/home/leeky/work/SS/.worktrees/issue-353-p4-13-spatial-outp
> ut-tn-to/assets/stata_do_library/fixtures/TN03/sample_data.csv", clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 6 obs)

. 
. gen long sid = _n

. 
. capture spset sid

. 
. display "spset_plain_rc=" _rc
spset_plain_rc=0

. 
. capture spset sid, coord(x cluster)

. display "spset_coord_rc=" _rc
spset_coord_rc=459

. 
. capture spset sid, coords(x cluster)

. display "spset_coords_space_rc=" _rc
spset_coords_space_rc=459

. 
. capture spset sid, coords(x, cluster)

. display "spset_coords_comma_rc=" _rc
spset_coords_comma_rc=459

. 
. capture spset sid, coordinates(x cluster)

. display "spset_coordinates_rc=" _rc
spset_coordinates_rc=459

. 
. capture spset sid, coords(x cluster) replace

. display "spset_coords_replace_rc=" _rc
spset_coords_replace_rc=459

. 
. capture spset sid, coord(x cluster) replace

. display "spset_coord_replace_rc=" _rc
spset_coord_replace_rc=459

. 
. log close
      name:  <unnamed>
       log:  \\wsl.localhost\Ubuntu\home\leeky\work\SS\.worktrees\issue-353-p4-
> 13-spatial-output-tn-to\rulebook\tasks\issue-353-p4-13-spatial-output-tn-to\e
> vidence\ss_spset_syntax_probe.result.log
  log type:  text
 closed on:  11 Jan 2026, 10:34:12
-------------------------------------------------------------------------------

. exit 0

end of do-file
